### [DataFrame 연산 - 2]
- 일대일 대응으로 인덱스가 동일한 원소끼리 연산
- DataFrame과 DataFrame데이터

In [1]:
import pandas as pd

In [2]:
data={'A':[98,78,100,52],
      'B':[90,70,80,50]}

In [5]:
DF1=pd.DataFrame(data)
DF2=DF1/4

In [6]:
print(DF1,DF2,sep='\n')

     A   B
0   98  90
1   78  70
2  100  80
3   52  50
      A     B
0  24.5  22.5
1  19.5  17.5
2  25.0  20.0
3  13.0  12.5

In [7]:
# 연산 수행
# - 산술연산
DF1+DF2

       A      B
0  122.5  112.5
1   97.5   87.5
2  125.0  100.0
3   65.0   62.5

In [8]:
# - 비교연산
DF1<=DF2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [11]:
# 연산 수행 DF 와 SR
# A 칼럼만 추출
# 산술연산 
SR1=DF1.A 
SR1+DF2

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [16]:
#SR to DF
SR2DF=SR1.to_frame()
DF1+SR2DF

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [19]:
# 전치
DF1.T+SR1

     0    1    2    3
A  196  156  200  104
B  188  148  180  102